cfg/Documents/СправкаОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СправкаОДоходах</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправокОДоходах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупныйДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоОблагаемое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОсновное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСовместительство</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоЗП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПрочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Алименты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КалендарныеДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВзносы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаемоеЕСВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаемоеЕСВПредел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСоциальнойЛьготы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалоговойЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходВоенныйСбор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВоенныйСбор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходЗаВычетомНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛПрочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаВзносов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиВыводаНаПечать</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выводить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонкиДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогиВПодвале</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Documents/СправкаОДоходах/Forms/ФормаНастройкиВыводаНаПечать/Ext/Form/Module.bsl
Процедура ДействияФормыДействиеОК(Кнопка)
	
	СтрокаПериода = ТабличнаяЧастьНастройки.Найти("Период");
	ИндексСтрокиПериода = ТабличнаяЧастьНастройки.Индекс(СтрокаПериода); 
	Если ИндексСтрокиПериода <> 0 Тогда 
		ТабличнаяЧастьНастройки.Сдвинуть(СтрокаПериода,-ИндексСтрокиПериода);		
	КонецЕсли;
	Если СтрокаПериода.ИтогиВПодвале Тогда
		 СтрокаПериода.ИтогиВПодвале = Ложь
	КонецЕсли;	 
	СтрокаПризнакСоциальнойЛьготы = ТабличнаяЧастьНастройки.Найти("ПризнакСоциальнойЛьготы");
	Если СтрокаПризнакСоциальнойЛьготы.ИтогиВПодвале Тогда
		 СтрокаПризнакСоциальнойЛьготы.ИтогиВПодвале = Ложь
	КонецЕсли;	 
	 
	ДокументОбъект.НастройкиВыводаНаПечать.Загрузить(ТабличнаяЧастьНастройки);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


Процедура ТабличнаяЧастьНастройкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура КоманднаяПанельКнопкаЗаполнитьПоУмолчанию(Кнопка)
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	ТабличнаяЧастьНастройки.Очистить();
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "Период";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Период';uk='Період'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ОблагаемоеЕСВ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='База ЕСВ';uk='База ЄСВ'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ОблагаемоеЕСВПредел";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='База ЕСВ с учетом предела';uk='База ЄСВ з урахуванням межі'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "РезультатВзносы";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Удержано ЕСВ';uk='Утримано ЄСВ'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ДоходНДФЛ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Начисленный доход';uk='Нарахований дохід'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "НДФЛ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Сумма НДФЛ';uk='Сума ПДФО'",КодЯзыкаПечать);
	//ВОЕННЫЙ СБОР
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ДоходВоенныйСбор";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Доход для военного сбора)';uk='Дохід для військового збору'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ВоенныйСбор";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Военный сбор)';uk='Військовий збір)'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ПризнакСоциальнойЛьготы";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Признак социальной льготы';uk='Ознака соціальної пільги'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "СуммаНалоговойЛьготы";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Сумма налоговой социальной льготы';uk='Сума податкової соціальної пільги'",КодЯзыкаПечать);
	
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "Выплачено";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Выплачено';uk='Виплачено'",КодЯзыкаПечать);
	
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ДоходЗаВычетомНДФЛ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Доход за вычетом НДФЛ';uk='Дохід за вирахуванням ПДФО'",КодЯзыкаПечать);
	
КонецПроцедуры

Процедура ТабличнаяЧастьНастройкиПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Отказ = Истина
	
КонецПроцедуры
